---
kind: method
id: M:Autodesk.Revit.DB.IPerformanceAdviserRule.WillCheckElements
source: html/f6ed103a-f629-2404-1d6e-fdea8eda69e7.htm
---
# Autodesk.Revit.DB.IPerformanceAdviserRule.WillCheckElements Method

Reports if rule needs to be executed on individual elements.

## Syntax (C#)
```csharp
bool WillCheckElements()
```

## Returns
True if rule needs to be executed on individual elements.